In [1]:
import pandas as pd

In [23]:
d = {
    "name": ["Thom", "Chihiro", "Shugo", "Nilufer"],
    "genre": ["rock", "jazz", "folk", "pop"],
    "num": [10, 20, 30, 40]
}

In [34]:
df = pd.DataFrame(d, index=[4,5,6,7])

In [35]:
df

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [36]:
df[0:2]

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20

In [42]:
df.loc[5:6]

      name genre  num
5  Chihiro  jazz   20
6    Shugo  folk   30

In [47]:
df.iloc[0:4]

      name genre  num
4     Thom  rock   10
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [49]:
df[df["num"] > 15]

      name genre  num
5  Chihiro  jazz   20
6    Shugo  folk   30
7  Nilufer   pop   40

In [50]:
g_list = ["jazz", "folk"]

In [57]:
df[df["genre"].isin(g_list)]

      name genre  num
5  Chihiro  jazz   20
6    Shugo  folk   30